artillery.yml
config:
  target: 'http://localhost:3001'
  phases:
      - duration: 10
        arrivalRate: 5
        name: "Is that even load? Do u even lyft?"
  defaults:
    headers:
      Accept-Encoding: 'gzip, deflate, br'
      Content-Type: 'application/json'
      Accept: 'application/json'
  environments:
    testing:
      phases:
        - duration: 30
          arrivalRate: 1
          rampTo: 10
          name: "Warm Up"
        - duration: 60
          arrivalRate: 10
          name: "Sustain"
        - duration: 30
          arrivalRate: 10
          rampTo: 1
          name: "Cool Down"
    staging:
      target: "https://staging.skills.ozzy.systems"
      phases:
        - duration: 120
          arrivalRate: 10
          rampTo: 50
          name: "Warm up the application"
        - duration: 600
          arrivalRate: 50
          name: "Sustained max load"
    production:
      target: "https://skills.ozzy.systems"
      phases:
        - duration: 120
          arrivalRate: 10
scenarios:
  - name: "Basic Smoke-Perf-Test"
    flow:
    - post:
        url: "/graphql"
        json:
          query: "query { people { id skills { id name } }}"
          variables: null